# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [25]:
!pip install mysql-connector-python
import mysql.connector
import pandas as pd

Requirement already satisfied: mysql-connector-python in i:\installations\lib\site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in i:\installations\lib\site-packages (from mysql-connector-python) (4.21.12)

### Connect to DB using Mysql-connector-python package

In [62]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@')

### You are required to create a database named 'e_commerce'

In [ ]:
cursor_object = connection.cursor()
create_db_query = "create database e_Commerce"
cursor_object.execute(create_db_query)

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [5]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

create_tables_query = """CREATE TABLE supplier (`SUPP_ID` int primary key,`SUPP_NAME` varchar(50) ,
                    `SUPP_CITY` varchar(50),`SUPP_PHONE` varchar(20));
                    
                    CREATE TABLE customer (`CUS_ID` INT NOT NULL,`CUS_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    `CUS_PHONE` VARCHAR(10),`CUS_CITY` varchar(30) ,`CUS_GENDER` CHAR,PRIMARY KEY (`CUS_ID`));
                    
                    CREATE TABLE category (`CAT_ID` INT NOT NULL,`CAT_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    PRIMARY KEY (`CAT_ID`));

                    CREATE TABLE product (`PRO_ID` INT NOT NULL,`PRO_NAME` VARCHAR(20) NULL DEFAULT NULL,
                    `PRO_DESC` VARCHAR(60) NULL DEFAULT NULL,`CAT_ID` INT NOT NULL,PRIMARY KEY (`PRO_ID`),
                    FOREIGN KEY (`CAT_ID`) REFERENCES CATEGORY (`CAT_ID`));
                    
                    CREATE TABLE product_details (`PROD_ID` INT NOT NULL,`PRO_ID` INT NOT NULL,`SUPP_ID` INT NOT NULL,
                    `PROD_PRICE` INT NOT NULL, PRIMARY KEY (`PROD_ID`),FOREIGN KEY (`PRO_ID`) REFERENCES PRODUCT (`PRO_ID`),
                    FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER(`SUPP_ID`));
                      
                    CREATE TABLE orders (`ORD_ID` INT NOT NULL,`ORD_AMOUNT` INT NOT NULL,`ORD_DATE` DATE,
                    `CUS_ID` INT NOT NULL,`PROD_ID` INT NOT NULL, PRIMARY KEY (`ORD_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`),
                    FOREIGN KEY (`PROD_ID`) REFERENCES PRODUCT_DETAILS(`PROD_ID`));
                    
                    CREATE TABLE rating (`RAT_ID` INT NOT NULL,`CUS_ID` INT NOT NULL,
                    `SUPP_ID` INT NOT NULL,`RAT_RATSTARS` INT NOT NULL,PRIMARY KEY (`RAT_ID`),
                    FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER (`SUPP_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`));"""

cursor_object.execute(create_tables_query)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [15]:
# insert into "supplier" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_supplier_details = """INSERT INTO supplier(SUPP_ID, SUPP_NAME, SUPP_CITY,SUPP_PHONE) 
                              VALUES (%s, %s, %s, %s)"""

val = [(1, 'Rajesh Retails', 'Delhi', '1234567890'),
       (2,'Appario Ltd.','Mumbai','258963147032'),
       (3,'Knome products','Bangalore', '9785462315'),
       (4, 'Bansal Retails', 'Kochi', '8975463285'),
       (5,'Mittal Ltd.','Lucknow','7898456532')]

cursor_object.executemany(insert_supplier_details, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [16]:
# insert into "customer" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_customers_query = "INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1,"AAKASH",'9999999999',"DELHI",'M'),
       (2,"AMAN",'9785463215',"NOIDA",'M'),
       (3,"NEHA",'9999999999',"MUMBAI",'F'),
       (4,"MEGHA",'9994562399',"KOLKATA",'F'),
       (5,"PULKIT",'7895999999',"LUCKNOW",'M')]


cursor_object.executemany(insert_customers_query, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [17]:
# insert into "categoty" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_category_query = "INSERT INTO category (CAT_ID, CAT_NAME) VALUES (%s, %s)"
val = [(1,"BOOKS"),
       (2,"GAMES"),
       (3,"GROCERIES"),
       (4,"ELECTRONICS"),
       (5,"CLOTHES")]


cursor_object.executemany(insert_category_query, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [18]:
# insert into "product" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_products_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]


cursor_object.executemany(insert_products_query, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [20]:
# insert into "product_details" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_productDetails_query = "INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]


cursor_object.executemany(insert_productDetails_query, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [21]:
# insert into "orders" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_orders_query = "INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]


cursor_object.executemany(insert_orders_query, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [22]:
# insert into "rating" table

connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

insert_ratings_query = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]


cursor_object.executemany(insert_ratings_query, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [51]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query3=     """
            select cus_gender, count(ord_amount)
            from customer inner join orders
            on customer.cus_id = orders.cus_id
            where ord_amount >= 3000
            group by cus_gender;
            """


cursor_object.execute(Query3)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Gender', 'Count'])
output_df

  Gender  Count
0      M      1
1      F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [52]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query4=     """
            select customer.cus_id, cus_name, orders.ord_id, product.pro_id, pro_name
            from customer inner join orders inner join product_details inner join product
            on customer.cus_id = orders.cus_id and orders.prod_id = product_details.PROD_ID and 
            product_details.PRO_ID = product.PRO_ID
            where customer.CUS_ID=2;

            """


cursor_object.execute(Query4)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Customer ID', 'Customer Name', 'Order ID', 'Product ID', 'Product Name'])
output_df

   Customer ID Customer Name  Order ID  Product ID Product Name
0            2          AMAN        50           1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [53]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query5=     """
                select supplier.SUPP_ID, supp_name, count(product.PRO_ID) as No_of_products
                from supplier inner join product_details inner join product
                on supplier.SUPP_ID=product_details.SUPP_ID and
                product_details.PRO_ID = product.PRO_ID
                group by supplier.SUPP_ID
                having count(product.PRO_ID) > 1;

            """


cursor_object.execute(Query5)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Supplier ID', 'Supplier Name', 'No. of Products Supplied'])
output_df

   Supplier ID   Supplier Name  No. of Products Supplied
0            1  Rajesh Retails                         2

### Q6) Find the category of the product whose order amount is minimum.

In [54]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query6=     """
             SELECT CATEGORY.* FROM `ORDERS` 
             INNER JOIN PRODUCT_DETAILS ON `ORDERS`.PROD_ID = PRODUCT_DETAILS.PROD_ID 
             INNER JOIN PRODUCT ON PRODUCT.PRO_ID = PRODUCT_DETAILS.PRO_ID
             INNER JOIN CATEGORY ON CATEGORY.CAT_ID = PRODUCT.CAT_ID 
             WHERE `ORDERS`.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM `ORDERS`);

            """


cursor_object.execute(Query6)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Category Id', 'CATEGORY NAME'])
output_df

   Category Id CATEGORY NAME
0            3     GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [55]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query7 =     """
            select ORD_DATE, product.PRO_ID, pro_name
            from orders inner join product_details inner join product
            on orders.PROD_ID=product_details.PROD_ID and product_details.PRO_ID = product.PRO_ID
            where ORD_DATE > '2021-10-05';

            """


cursor_object.execute(Query7)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Order Date', 'Product ID', 'Product Name'])
output_df

   Order Date  Product ID Product Name
0  2021-10-12           4         OATS
1  2021-10-06           1        GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [56]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query8 =    """
            select distinct(supplier.SUPP_ID), supp_name, RAT_RATSTARS, cus_name
            from supplier inner join rating inner join customer
            on supplier.SUPP_ID = rating.SUPP_ID and rating.CUS_ID= customer.CUS_ID
            order by RAT_RATSTARS desc limit 3;

            """


cursor_object.execute(Query8)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Supplier_Id', 'Supplier_Name','Rating','Rated by'])
output_df

   Supplier_Id   Supplier_Name  Rating Rated by
0            1  Rajesh Retails       5   PULKIT
1            2    Appario Ltd.       4     AMAN
2            5     Mittal Ltd.       4    MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [57]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query9 =    """
            select cus_name, cus_gender
            from customer
            where cus_name like 'A%' or cus_name like '%A';

            """


cursor_object.execute(Query9)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Customer Name', 'Gender'])
output_df

  Customer Name Gender
0        AAKASH      M
1          AMAN      M
2          NEHA      F
3         MEGHA      F

### Q10) Display the total order amount of the male customers.

In [58]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query10 =   """
            select cus_gender, sum(ord_amount)
            from customer inner join orders
            on customer.CUS_ID = orders.CUS_ID
            where CUS_GENDER = 'M';

            """


cursor_object.execute(Query10)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output, columns=['Gender', 'Order Amount'])
output_df

  Gender Order Amount
0      M        34500

### Q11) Display all the Customers left outer join with  the orders

In [61]:
connection = mysql.connector.connect(host='localhost', user='root', passwd='oxfordpublic123@', database="e_Commerce")
cursor_object = connection.cursor()

Query11 =   """
            select customer.cus_id, cus_name, cus_phone, cus_city, cus_gender,
            ord_id, ord_amount, ord_date, prod_id  
            from customer LEFT OUTER JOIN orders
            ON customer.CUS_ID = orders.CUS_ID;

            """


cursor_object.execute(Query11)
output = cursor_object.fetchall()
output_df = pd.DataFrame(output,columns=['Customer_Id','Customer_Name', 'Phone_No', 'City', 'Gender', 'Order_Id', 'Order_Amount', 'Order_Date','Product_Id'] )
output_df

,Customer_Id,Customer_Name,Phone_No,City,Gender,Order_Id,Order_Amount,Order_Date,Product_Id
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,1
2,3,NEHA,9999999999,MUMBAI,F,20,1500,2021-10-12,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,2

In [60]:
connection.close()

## Happy Learning:)